stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
} RCC_ClkInitTypeDef;

/**
  * @}
  */
/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Oscillator_Type Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE        (0x00000000U)   /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSE         (0x00000001U)   /*!< HSE to configure */
#define RCC_OSCILLATORTYPE_HSI         (0x00000002U)   /*!< HSI to configure */
#define RCC_OSCILLATORTYPE_LSE         (0x00000004U)   /*!< LSE to configure */
#define RCC_OSCILLATORTYPE_LSI         (0x00000008U)   /*!< LSI to configure */
#define RCC_OSCILLATORTYPE_MSI         (0x00000010U)   /*!< MSI to configure */
#if defined(RCC_CRRCR_HSI48ON)
#define RCC_OSCILLATORTYPE_HSI48       (0x00000020U)   /*!< HSI48 to configure */
#endif /* RCC_CRRCR_HSI48ON */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config HSE Config
  * @{
  */
#define RCC_HSE_OFF                    (0x00000000U)                              /*!< HSE clock deactivation */
#define RCC_HSE_ON                     RCC_CR_HSEON                               /*!< HSE clock activation */
#define RCC_HSE_BYPASS                 ((uint32_t)(RCC_CR_HSEBYP | RCC_CR_HSEON)) /*!< External clock source for HSE clock */
/**
  * @}
  */

/** @defgroup RCC_LSE_Config LSE Config
  * @{
  */
#define RCC_LSE_OFF                    (0x00000000U)                                          /*!< LSE clock deactivation */
#define RCC_LSE_ON_RTC_ONLY            RCC_BDCR_LSEON                                         /*!< LSE clock activation for RTC only */
#define RCC_LSE_ON                     (RCC_BDCR_LSESYSEN | RCC_BDCR_LSEON)                   /*!< LSE clock activation for RCC and peripherals */
#define RCC_LSE_BYPASS_RTC_ONLY        (RCC_BDCR_LSEBYP | RCC_BDCR_LSEON)                     /*!< External clock source for LSE clock */
#define RCC_LSE_BYPASS                 (RCC_BDCR_LSEBYP | RCC_BDCR_LSESYSEN | RCC_BDCR_LSEON) /*!< External clock source for LSE clock */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config HSI Config
  * @{
  */
#define RCC_HSI_OFF                    (0x00000000U)          /*!< HSI clock deactivation */
#define RCC_HSI_ON                     RCC_CR_HSION           /*!< HSI clock activation */

#define RCC_HSICALIBRATION_DEFAULT     (0x40U)                /*! Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                    (0x00000000U)      /*!< LSI clock deactivation */
#define RCC_LSI_ON                     RCC_CSR_LSION      /*!< LSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_LSI_Div LSI Div
  * @{
  */
#define RCC_LSI_DIV1                   (0x00000000U)       /*!< LSI clock is not divided */
#define RCC_LSI_DIV128                 RCC_CSR_LSIPREDIV   /*!< LSI clock is divided by 128 */
/**
  * @}
  */

/** @defgroup RCC_MSI_Config MSI Config
  * @{
  */
#define RCC_MSI_OFF                    (0x00000000U)       /*!< MSI clock deactivation */
#define RCC_MSI_ON                     RCC_CR_MSION        /*!< MSI clock activation */

#define RCC_MSICALIBRATION_DEFAULT     (0x0U)              /*!< Default MSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_HSIK_Config HSIK Config
  * @{
  */
#define RCC_HSIK_OFF                   (0x00000000U)       /*!< HSIK clock deactivation */
#define RCC_HSIK_ON                    RCC_CR_HSIKERON     /*!< HSIK clock activation */
/**
  * @}
  */

/** @defgroup RCC_HSIASFS_Config HSIASFS Config
  * @{
  */
#define RCC_HSIASFS_OFF                (0x00000000U)         /*!< HSIASFS clock deactivation */
#define RCC_HSIASFS_ON                 RCC_CR_HSIASFSON      /*!< HSIASFS clock activation */
/**
  * @}
  */

/** @defgroup RCC_HSECSS_Config HSECSS Config
  * @{
  */
#define RCC_HSECSS_OFF                 (0x00000000U)         /*!< HSECSS clock deactivation */
#define RCC_HSECSS_ON                  RCC_CR_HSECSSON       /*!< HSECSS clock activation */

/**
  * @}
  */
#if defined(RCC_CRRCR_HSI48ON)
/** @defgroup RCC_HSI48_Config HSI48 Config
  * @{
  */
#define RCC_HSI48_OFF                 (0x00000000U)          /*!< HSI48 clock deactivation */
#define RCC_HSI48_ON                  RCC_CRRCR_HSI48ON      /*!< HSI48 clock activation */
#endif /* RCC_CRRCR_HSI48ON */
/**
  * @}
  */

/** @defgroup RCC_PLL_Config  RCC PLL Config
  * @{
  */
#define RCC_PLL_NONE                 (0x00000000U)
#define RCC_PLL_OFF                  (0x00000001U)
#define RCC_PLL_ON                   (0x00000002U)

/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Output  RCC PLL Clock Output
  * @{
  */
#define RCC_PLL_DIVP                RCC_PLLCFGR_PLLPEN
#define RCC_PLL_DIVQ                RCC_PLLCFGR_PLLQEN
#define RCC_PLL_DIVR                RCC_PLLCFGR_PLLREN

/**
  * @}
  */

/** @defgroup RCC_PLLM_Clock_Divider PLLM Clock Divider
  * @{
  */
#define RCC_PLLM_DIV1       0x00000000U                                                    /*!< PLLM division factor = 8  */
#define RCC_PLLM_DIV2       RCC_PLLCFGR_PLLM_0                                             /*!< PLLM division factor = 2  */
#define RCC_PLLM_DIV3       RCC_PLLCFGR_PLLM_1                                             /*!< PLLM division factor = 3  */
#define RCC_PLLM_DIV4       (RCC_PLLCFGR_PLLM_1 | RCC_PLLCFGR_PLLM_0)                      /*!< PLLM division factor = 4  */
#define RCC_PLLM_DIV5       RCC_PLLCFGR_PLLM_2                                             /*!< PLLM division factor = 5  */
#define RCC_PLLM_DIV6       (RCC_PLLCFGR_PLLM_2 | RCC_PLLCFGR_PLLM_0)                      /*!< PLLM division factor = 6  */
#define RCC_PLLM_DIV7       (RCC_PLLCFGR_PLLM_2 | RCC_PLLCFGR_PLLM_1)                      /*!< PLLM division factor = 7  */
#define RCC_PLLM_DIV8       (RCC_PLLCFGR_PLLM_2 | RCC_PLLCFGR_PLLM_1| RCC_PLLCFGR_PLLM_0)  /*!< PLLM division factor = 8  */
/**
  * @}
  */
/** @defgroup RCC_PLLP_Clock_Divider PLLP Clock Divider
  * @{
  */
#define RCC_PLLP_DIV2        RCC_PLLCFGR_PLLP_0                                                                   /*!< PLLP division factor = 2  */
#define RCC_PLLP_DIV3        RCC_PLLCFGR_PLLP_1                                                                   /*!< PLLP division factor = 3  */
#define RCC_PLLP_DIV4        (RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)                                            /*!< PLLP division factor = 4  */
#define RCC_PLLP_DIV5        RCC_PLLCFGR_PLLP_2                                                                   /*!< PLLP division factor = 5  */
#define RCC_PLLP_DIV6        (RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_0)                                            /*!< PLLP division factor = 6  */
#define RCC_PLLP_DIV7        (RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1)                                            /*!< PLLP division factor = 7  */
#define RCC_PLLP_DIV8        (RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)                       /*!< PLLP division factor = 8  */
#define RCC_PLLP_DIV9        RCC_PLLCFGR_PLLP_3                                                                   /*!< PLLP division factor = 9  */
#define RCC_PLLP_DIV10       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_0)                                            /*!< PLLP division factor = 10 */
#define RCC_PLLP_DIV11       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_1)                                            /*!< PLLP division factor = 11 */
#define RCC_PLLP_DIV12       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)                       /*!< PLLP division factor = 12 */
#define RCC_PLLP_DIV13       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2)                                            /*!< PLLP division factor = 13 */
#define RCC_PLLP_DIV14       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_0)                       /*!< PLLP division factor = 14 */
#define RCC_PLLP_DIV15       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1)                       /*!< PLLP division factor = 15 */
#define RCC_PLLP_DIV16       (RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)  /*!< PLLP division factor = 16 */
#define RCC_PLLP_DIV17       RCC_PLLCFGR_PLLP_4                                                                   /*!< PLLP division factor = 17 */
#define RCC_PLLP_DIV18       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_0)                                            /*!< PLLP division factor = 18 */
#define RCC_PLLP_DIV19       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_1)                                            /*!< PLLP division factor = 19 */
#define RCC_PLLP_DIV20       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)                       /*!< PLLP division factor = 20 */
#define RCC_PLLP_DIV21       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_2)                                            /*!< PLLP division factor = 21 */
#define RCC_PLLP_DIV22       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_0)                       /*!< PLLP division factor = 22 */
#define RCC_PLLP_DIV23       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1)                       /*!< PLLP division factor = 23 */
#define RCC_PLLP_DIV24       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)  /*!< PLLP division factor = 24 */
#define RCC_PLLP_DIV25       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3)                                            /*!< PLLP division factor = 25 */
#define RCC_PLLP_DIV26       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_0)                       /*!< PLLP division factor = 26 */
#define RCC_PLLP_DIV27       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_1)                       /*!< PLLP division factor = 27 */
#define RCC_PLLP_DIV28       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_1 | RCC_PLLCFGR_PLLP_0)  /*!< PLLP division factor = 28 */
#define RCC_PLLP_DIV29       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2)                       /*!< PLLP division factor = 29 */
#define RCC_PLLP_DIV30       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_0)  /*!< PLLP division factor = 30 */
#define RCC_PLLP_DIV31       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1)  /*!< PLLP division factor = 31 */
#define RCC_PLLP_DIV32       (RCC_PLLCFGR_PLLP_4 | RCC_PLLCFGR_PLLP_3 | RCC_PLLCFGR_PLLP_2 | RCC_PLLCFGR_PLLP_1 | \
                              RCC_PLLCFGR_PLLP_0)                                                                 /*!< PLLP division factor = 32 */
/**
  * @}
  */

/** @defgroup RCC_PLLQ_Clock_Divider PLLQ Clock Divider
  * @{
  */
#define RCC_PLLQ_DIV2       RCC_PLLCFGR_PLLQ_0                                             /*!< PLLQ division factor = 2 */
#define RCC_PLLQ_DIV3       RCC_PLLCFGR_PLLQ_1                                             /*!< PLLQ division factor = 3 */
#define RCC_PLLQ_DIV4       (RCC_PLLCFGR_PLLQ_1 | RCC_PLLCFGR_PLLQ_0)                      /*!< PLLQ division factor = 4 */
#define RCC_PLLQ_DIV5       RCC_PLLCFGR_PLLQ_2                                             /*!< PLLQ division factor = 5 */
#define RCC_PLLQ_DIV6       (RCC_PLLCFGR_PLLQ_2 | RCC_PLLCFGR_PLLQ_0)                      /*!< PLLQ division factor = 6 */
#define RCC_PLLQ_DIV7       (RCC_PLLCFGR_PLLQ_2 | RCC_PLLCFGR_PLLQ_1)                      /*!< PLLQ division factor = 7 */
#define RCC_PLLQ_DIV8       (RCC_PLLCFGR_PLLQ_2 |RCC_PLLCFGR_PLLQ_1 | RCC_PLLCFGR_PLLQ_0)  /*!< PLLQ division factor = 8 */
/**
  * @}
  */

/** @defgroup RCC_PLLR_Clock_Divider PLLR Clock Divider
  * @{
  */
#define RCC_PLLR_DIV2       RCC_PLLCFGR_PLLR_0                                             /*!< PLLR division factor = 2 */
#define RCC_PLLR_DIV3       RCC_PLLCFGR_PLLR_1                                             /*!< PLLR division factor = 3 */
#define RCC_PLLR_DIV4       (RCC_PLLCFGR_PLLR_1 | RCC_PLLCFGR_PLLR_0)                      /*!< PLLR division factor = 4 */
#define RCC_PLLR_DIV5       RCC_PLLCFGR_PLLR_2                                             /*!< PLLR division factor = 5 */
#define RCC_PLLR_DIV6       (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_0)                      /*!< PLLR division factor = 6 */
#define RCC_PLLR_DIV7       (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_1)                      /*!< PLLR division factor = 7 */
#define RCC_PLLR_DIV8       (RCC_PLLCFGR_PLLR_2 | RCC_PLLCFGR_PLLR_1 | RCC_PLLCFGR_PLLR_0) /*!< PLLR division factor = 8 */
/**
  * @}
  */

