stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
/** @defgroup RCC_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCO1SOURCE_NOCLOCK         (0x00000000U)                                                   /*!< MCO1 output disabled, no clock on MCO1 */
#define RCC_MCO1SOURCE_SYSCLK          RCC_CFGR_MCO1SEL_0                                              /*!< SYSCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_MSI             RCC_CFGR_MCO1SEL_1                                              /*!< MSI selection as MCO1 source */
#define RCC_MCO1SOURCE_HSI             (RCC_CFGR_MCO1SEL_0 | RCC_CFGR_MCO1SEL_1)                       /*!< HSI selection as MCO1 source */
#define RCC_MCO1SOURCE_HSE             RCC_CFGR_MCO1SEL_2                                              /*!< HSE selection as MCO1 source */
#define RCC_MCO1SOURCE_PLLR            (RCC_CFGR_MCO1SEL_0 | RCC_CFGR_MCO1SEL_2)                       /*!< PLLCLK selection as MCO1 source */
#define RCC_MCO1SOURCE_LSI             (RCC_CFGR_MCO1SEL_1 | RCC_CFGR_MCO1SEL_2)                       /*!< LSI selection as MCO1 source */
#define RCC_MCO1SOURCE_LSE             (RCC_CFGR_MCO1SEL_0 | RCC_CFGR_MCO1SEL_1 | RCC_CFGR_MCO1SEL_2)  /*!< LSE selection as MCO1 source */
#if defined(RCC_CRRCR_HSI48ON)
#define RCC_MCO1SOURCE_HSI48           RCC_CFGR_MCO1SEL_3                                              /*!< HSI48 selection as MCO1 source */
#endif /* RCC_CRRCR_HSI48ON */
#define RCC_MCO1SOURCE_RTC_ALT         (RCC_CFGR_MCO1SEL_0 | RCC_CFGR_MCO1SEL_3)                       /*!< RTC alternative clock selection as MCO1 source */
#define RCC_MCO1SOURCE_RTC_WAKEUP      (RCC_CFGR_MCO1SEL_1 | RCC_CFGR_MCO1SEL_3)                       /*!< RTC wakeup interrupt signal selection as MCO1 source */
/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Source MCO2 Clock Source
  * @{
  */
#define RCC_MCO2SOURCE_NOCLOCK         (0x00000000U)                                                   /*!< MCO2 output disabled, no clock on MCO2 */
#define RCC_MCO2SOURCE_SYSCLK          RCC_CFGR_MCO2SEL_0                                              /*!< SYSCLK selection as MCO2 source */
#define RCC_MCO2SOURCE_MSI             RCC_CFGR_MCO2SEL_1                                              /*!< MSI selection as MCO2 source */
#define RCC_MCO2SOURCE_HSI             (RCC_CFGR_MCO2SEL_0 | RCC_CFGR_MCO2SEL_1)                       /*!< HSI selection as MCO2 source */
#define RCC_MCO2SOURCE_HSE             RCC_CFGR_MCO2SEL_2                                              /*!< HSE selection as MCO2 source */
#define RCC_MCO2SOURCE_PLLR            (RCC_CFGR_MCO2SEL_0 | RCC_CFGR_MCO2SEL_2)                       /*!< PLLCLK selection as MCO2 source */
#define RCC_MCO2SOURCE_LSI             (RCC_CFGR_MCO2SEL_1 | RCC_CFGR_MCO2SEL_2)                       /*!< LSI selection as MCO2 source */
#define RCC_MCO2SOURCE_LSE             (RCC_CFGR_MCO2SEL_0 | RCC_CFGR_MCO2SEL_1 | RCC_CFGR_MCO2SEL_2)  /*!< LSE selection as MCO2 source */
#if defined(RCC_CRRCR_HSI48ON)
#define RCC_MCO2SOURCE_HSI48           RCC_CFGR_MCO2SEL_3                                              /*!< HSI48 selection as MCO2 source */
#endif /* RCC_CRRCR_HSI48ON */
#define RCC_MCO2SOURCE_RTC_ALT         (RCC_CFGR_MCO2SEL_0 | RCC_CFGR_MCO2SEL_3)                       /*!< RTC alternative clock selection as MCO2 source */
#define RCC_MCO2SOURCE_RTC_WAKEUP      (RCC_CFGR_MCO2SEL_1 | RCC_CFGR_MCO2SEL_3)                       /*!< RTC wakeup interrupt signal selection as MCO2 source */
/**
  * @}
  */

/** @defgroup RCC_MCO1_Clock_Prescaler MCO1 Clock Prescaler
  * @{
  */
#define RCC_MCO1DIV_1         (0x00000000U)                                                  /*!< MCO divided by 1 */
#define RCC_MCO1DIV_2         RCC_CFGR_MCO1PRE_0                                             /*!< MCO divided by 2 */
#define RCC_MCO1DIV_4         RCC_CFGR_MCO1PRE_1                                             /*!< MCO divided by 4 */
#define RCC_MCO1DIV_8         (RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_0)                      /*!< MCO divided by 8 */
#define RCC_MCO1DIV_16        RCC_CFGR_MCO1PRE_2                                             /*!< MCO divided by 16 */
#define RCC_MCO1DIV_32        (RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_0)                      /*!< MCO divided by 32 */
#define RCC_MCO1DIV_64        (RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_1)                      /*!< MCO divided by 64 */
#define RCC_MCO1DIV_128       (RCC_CFGR_MCO1PRE_2 | RCC_CFGR_MCO1PRE_1 | RCC_CFGR_MCO1PRE_0) /*!< MCO divided by 128 */
#define RCC_MCO1DIV_256       RCC_CFGR_MCO1PRE_3                                             /*!< MCO divided by 256 */
#define RCC_MCO1DIV_512       (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_0)                      /*!< MCO divided by 512 */
#define RCC_MCO1DIV_1024      (RCC_CFGR_MCO1PRE_3 | RCC_CFGR_MCO1PRE_1)                      /*!< MCO divided by 1024 */
/**
  * @}
  */

/** @defgroup RCC_MCO2_Clock_Prescaler MCO2 Clock Prescaler
  * @{
  */
#define RCC_MCO2DIV_1         (0x00000000U)                                                  /*!< MCO divided by 1 */
#define RCC_MCO2DIV_2         RCC_CFGR_MCO2PRE_0                                             /*!< MCO divided by 2 */
#define RCC_MCO2DIV_4         RCC_CFGR_MCO2PRE_1                                             /*!< MCO divided by 4 */
#define RCC_MCO2DIV_8         (RCC_CFGR_MCO2PRE_1 | RCC_CFGR_MCO2PRE_0)                      /*!< MCO divided by 8 */
#define RCC_MCO2DIV_16        RCC_CFGR_MCO2PRE_2                                             /*!< MCO divided by 16 */
#define RCC_MCO2DIV_32        (RCC_CFGR_MCO2PRE_2 | RCC_CFGR_MCO2PRE_0)                      /*!< MCO divided by 32 */
#define RCC_MCO2DIV_64        (RCC_CFGR_MCO2PRE_2 | RCC_CFGR_MCO2PRE_1)                      /*!< MCO divided by 64 */
#define RCC_MCO2DIV_128       (RCC_CFGR_MCO2PRE_2 | RCC_CFGR_MCO2PRE_1 | RCC_CFGR_MCO1PRE_0) /*!< MCO divided by 128 */
#define RCC_MCO2DIV_256       RCC_CFGR_MCO2PRE_3                                             /*!< MCO divided by 256 */
#define RCC_MCO2DIV_512       (RCC_CFGR_MCO2PRE_3 | RCC_CFGR_MCO2PRE_0)                      /*!< MCO divided by 512 */
#define RCC_MCO2DIV_1024      (RCC_CFGR_MCO2PRE_3 | RCC_CFGR_MCO2PRE_1)                      /*!< MCO divided by 1024 */
/**
  * @}
  */

/** @defgroup RCC_Interrupt Interrupts
  * @{
  */
#define RCC_IT_LSIRDY                  RCC_CIFR_LSIRDYF      /*!< LSI Ready Interrupt flag */
#define RCC_IT_LSERDY                  RCC_CIFR_LSERDYF      /*!< LSE Ready Interrupt flag */
#define RCC_IT_MSIRDY                  RCC_CIFR_MSIRDYF      /*!< MSI Ready Interrupt flag */
#define RCC_IT_HSIRDY                  RCC_CIFR_HSIRDYF      /*!< HSI16 Ready Interrupt flag */
#define RCC_IT_HSERDY                  RCC_CIFR_HSERDYF      /*!< HSE Ready Interrupt flag */
#define RCC_IT_PLLRDY                  RCC_CIFR_PLLRDYF      /*!< PLL Ready Interrupt flag */
#define RCC_IT_CSS                     RCC_CIFR_CSSF         /*!< HSE Clock Security System Interrupt flag */
#define RCC_IT_LSECSS                  RCC_CIFR_LSECSSF      /*!< LSE Clock Security System Interrupt flag */
#if defined(RCC_CIFR_HSI48RDYF)
#define RCC_IT_HSI48RDY                RCC_CIFR_HSI48RDYF    /*!< HSI48 Ready Interrupt flag */
#endif /* RCC_CIFR_HSI48RDYF */

/**
  * @}
  */

/** @defgroup RCC_Flag Flags
  *        Elements values convention: XXXYYYYYb
  *           - YYYYY  : Flag position in the register
  *           - XXX  : Register index
  *                 - 001: CR register
  *                 - 010: BDCR register
  *                 - 011: CSR register
  * @{
  */
/* Flags in the CR register */
#define RCC_FLAG_MSIRDY           ((uint32_t)((CR_REG_INDEX << 5U) | RCC_CR_MSIRDY_Pos))        /*!< MSI Ready flag */
#define RCC_FLAG_HSIRDY           ((uint32_t)((CR_REG_INDEX << 5U) | RCC_CR_HSIDY_Pos))         /*!< HSI Ready flag */
#define RCC_FLAG_HSERDY           ((uint32_t)((CR_REG_INDEX << 5U) | RCC_CR_HSERDY_Pos))        /*!< HSE Ready flag */
#define RCC_FLAG_PLLRDY           ((uint32_t)((CR_REG_INDEX << 5U) | RCC_CR_PLLRDY_Pos))        /*!< PLL Ready flag */

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY           ((uint32_t)((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSERDY_Pos))    /*!< LSE Ready flag */
#define RCC_FLAG_LSECSSD          ((uint32_t)((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSECSSD_Pos))   /*!< LSE Clock Security System Interrupt flag */
#define RCC_FLAG_LSESYSRDY        ((uint32_t)((BDCR_REG_INDEX << 5U) | RCC_BDCR_LSESYSRDY_Pos)) /*!< LSE clock ready to be used by the system */

