stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
#define __HAL_RCC_LPUART2_CLK_DISABLE()         CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LPUART2EN)

#if defined (LCD)
#define __HAL_RCC_LCD_CLK_DISABLE()             CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LCDEN)
#endif /* LCD */

#define __HAL_RCC_RTCAPB_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_RTCAPBEN)

#define __HAL_RCC_WWDG_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_WWDGEN)

#if defined (LPUART3)
#define __HAL_RCC_LPUART3_CLK_DISABLE()         CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LPUART3EN)
#endif /* LPUART3 */
#if defined (USB_DRD_FS)
#define __HAL_RCC_USB_CLK_DISABLE()             CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_USBEN)
#endif /* USB_DRD_FS */

#define __HAL_RCC_SPI2_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_SPI2EN)

#define __HAL_RCC_SPI3_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_SPI3EN)
#if defined(CRS)
#define __HAL_RCC_CRS_CLK_DISABLE()             CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_CRSEN)
#endif /* CRS */
#define __HAL_RCC_USART2_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_USART2EN)

#define __HAL_RCC_USART3_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_USART3EN)

#define __HAL_RCC_USART4_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_USART4EN)

#define __HAL_RCC_LPUART1_CLK_DISABLE()         CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LPUART1EN)

#define __HAL_RCC_I2C1_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_I2C1EN)

#define __HAL_RCC_I2C2_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_I2C2EN)

#define __HAL_RCC_I2C3_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_I2C3EN)

#define __HAL_RCC_OPAMP_CLK_DISABLE()           CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_OPAMPEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_I2C4EN)
#endif /* I2C4 */
#if defined (LPTIM3)
#define __HAL_RCC_LPTIM3_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM3EN)
#endif /* LPTIM3 */
#define __HAL_RCC_PWR_CLK_DISABLE()             CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_PWREN)

#define __HAL_RCC_DAC1_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_DAC1EN)

#define __HAL_RCC_LPTIM2_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM2EN)

#define __HAL_RCC_LPTIM1_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM1EN)

/**
  * @}
  */

/** @defgroup RCC_APB_Peripheral_Clock_Enable_Disable APB Peripheral Clock Enable Disable
  * @brief  Enable or disable the APB peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_SYSCFG_CLK_ENABLE()          do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

#define __HAL_RCC_COMP_CLK_ENABLE()          __HAL_RCC_SYSCFG_CLK_ENABLE()

#define __HAL_RCC_VREFBUF_CLK_ENABLE()       __HAL_RCC_SYSCFG_CLK_ENABLE()

#define __HAL_RCC_TIM1_CLK_ENABLE()            do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

#define __HAL_RCC_SPI1_CLK_ENABLE()            do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

#define __HAL_RCC_USART1_CLK_ENABLE()          do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

#define __HAL_RCC_TIM15_CLK_ENABLE()           do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

#define __HAL_RCC_TIM16_CLK_ENABLE()           do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

