stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
#define __HAL_RCC_ADC_CLK_ENABLE()             do { \
                                                    __IO uint32_t tmpreg; \
                                                    SET_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN); \
                                                    /* Delay after an RCC peripheral clock enabling */ \
                                                    tmpreg = READ_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN); \
                                                    UNUSED(tmpreg); \
                                                  } while(0U)

#define __HAL_RCC_SYSCFG_CLK_DISABLE()         CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN)

#define __HAL_RCC_COMP_CLK_DISABLE()           __HAL_RCC_SYSCFG_CLK_DISABLE()

#define __HAL_RCC_VREFBUF_CLK_DISABLE()        __HAL_RCC_SYSCFG_CLK_DISABLE()

#define __HAL_RCC_TIM1_CLK_DISABLE()           CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN)

#define __HAL_RCC_SPI1_CLK_DISABLE()           CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN)

#define __HAL_RCC_USART1_CLK_DISABLE()         CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN)

#define __HAL_RCC_TIM15_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN)

#define __HAL_RCC_TIM16_CLK_DISABLE()          CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN)

#define __HAL_RCC_ADC_CLK_DISABLE()            CLEAR_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN)

/**
  * @}
  */

/** @defgroup RCC_AHB_Peripheral_Clock_Enable_Disable_Status AHB Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the AHB peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */

#define __HAL_RCC_DMA1_IS_CLK_ENABLED()         (READ_BIT(RCC->AHBENR, RCC_AHBENR_DMA1EN) != 0U)

#if defined (DMA2)
#define __HAL_RCC_DMA2_IS_CLK_ENABLED()         (READ_BIT(RCC->AHBENR, RCC_AHBENR_DMA2EN) != 0U)
#endif  /*DMA2 */

#define __HAL_RCC_FLASH_IS_CLK_ENABLED()        (READ_BIT(RCC->AHBENR, RCC_AHBENR_FLASHEN) != 0U)

#define __HAL_RCC_CRC_IS_CLK_ENABLED()          (READ_BIT(RCC->AHBENR, RCC_AHBENR_CRCEN) != 0U)

#if defined (AES)
#define __HAL_RCC_AES_IS_CLK_ENABLED()          (READ_BIT(RCC->AHBENR, RCC_AHBENR_AESEN) != 0U)
#endif /* AES */

#define __HAL_RCC_RNG_IS_CLK_ENABLED()          (READ_BIT(RCC->AHBENR, RCC_AHBENR_RNGEN) != 0U)

#define __HAL_RCC_TSC_IS_CLK_ENABLED()          (READ_BIT(RCC->AHBENR, RCC_AHBENR_TSCEN) != 0U)

#define __HAL_RCC_DMA1_IS_CLK_DISABLED()        (READ_BIT(RCC->AHBENR, RCC_AHBENR_DMA1EN) == 0U)

#if defined (DMA2)
#define __HAL_RCC_DMA2_IS_CLK_DISABLED()        (READ_BIT(RCC->AHBENR, RCC_AHBENR_DMA2EN) == 0U)
#endif /* DMA2 */

#define __HAL_RCC_FLASH_IS_CLK_DISABLED()       (READ_BIT(RCC->AHBENR, RCC_AHBENR_FLASHEN) == 0U)

#define __HAL_RCC_CRC_IS_CLK_DISABLED()         (READ_BIT(RCC->AHBENR, RCC_AHBENR_CRCEN) == 0U)

#define __HAL_RCC_TSC_IS_CLK_DISABLED()         (READ_BIT(RCC->AHBENR, RCC_AHBENR_TSCEN) == 0U)

#define __HAL_RCC_RNG_IS_CLK_DISABLED()         (READ_BIT(RCC->AHBENR, RCC_AHBENR_RNGEN) == 0U)

#if defined (AES)
#define __HAL_RCC_AES_IS_CLK_DISABLED()         (READ_BIT(RCC->AHBENR, RCC_AHBENR_AESEN) == 0U)
#endif /* AES */

/**
  * @}
  */

/** @defgroup RCC__Peripheral_Clock_Enable_Disable_Status APB Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_TIM2_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM2EN) != 0U)

#define __HAL_RCC_TIM3_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM3EN) != 0U)

#define __HAL_RCC_TIM6_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM6EN) != 0U)

#define __HAL_RCC_TIM7_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM7EN) != 0U)

#define __HAL_RCC_LPUART2_IS_CLK_ENABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART2EN) != 0U)

#if defined (LCD)
#define __HAL_RCC_LCD_IS_CLK_ENABLED()             (READ_BIT(RCC->APBENR1, RCC_APBENR1_LCDEN) != 0U)
#endif /* LCD */

#define __HAL_RCC_RTCAPB_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_RTCAPBEN) != 0U)

#define __HAL_RCC_WWDG_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_WWDGEN) != 0U)

#if defined (LPUART3)
#define __HAL_RCC_LPUART3_IS_CLK_ENABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART3EN) != 0U)
#endif /* LPUART3 */

#if defined (USB_DRD_FS)
#define __HAL_RCC_USB_IS_CLK_ENABLED()             (READ_BIT(RCC->APBENR1, RCC_APBENR1_USBEN) != 0U)
#endif /* USB_DRD_FS */

#define __HAL_RCC_SPI2_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_SPI2EN) != 0U)

#define __HAL_RCC_SPI3_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_SPI3EN) != 0U)
#if defined(CRS)
#define __HAL_RCC_CRS_IS_CLK_ENABLED()             (READ_BIT(RCC->APBENR1, RCC_APBENR1_CRSEN) != 0U)
#endif /* CRS */
#define __HAL_RCC_USART2_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_USART2EN) != 0U)

#define __HAL_RCC_USART3_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_USART3EN) != 0U)

#define __HAL_RCC_USART4_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_USART4EN) != 0U)

#define __HAL_RCC_LPUART1_IS_CLK_ENABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART1EN) != 0U)

#define __HAL_RCC_I2C1_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C1EN) != 0U)

#define __HAL_RCC_I2C2_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C2EN) != 0U)

#define __HAL_RCC_I2C3_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C3EN) != 0U)

#define __HAL_RCC_OPAMP_IS_CLK_ENABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_OPAMPEN) != 0U)
#if defined(I2C4)
#define __HAL_RCC_I2C4_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C4EN) != 0U)
#endif /* I2C4 */
#if defined (LPTIM3)
#define __HAL_RCC_LPTIM3_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM3EN) != 0U)
#endif /* LPTIM3 */

