stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
#define __HAL_RCC_PWR_IS_CLK_ENABLED()             (READ_BIT(RCC->APBENR1, RCC_APBENR1_PWREN) != 0U)

#define __HAL_RCC_DAC1_IS_CLK_ENABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_DAC1EN) != 0U)

#define __HAL_RCC_LPTIM2_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM2EN) != 0U)

#define __HAL_RCC_LPTIM1_IS_CLK_ENABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1y_LPTIM1EN) != 0U)

#define __HAL_RCC_TIM2_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM2EN) == 0U)

#define __HAL_RCC_TIM3_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM3EN) == 0U)

#define __HAL_RCC_TIM6_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM6EN) == 0U)

#define __HAL_RCC_TIM7_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_TIM7EN) == 0U)

#define __HAL_RCC_LPUART2_IS_CLK_DISABLED()        (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART2EN) == 0U)

#if defined (LCD)
#define __HAL_RCC_LCD_IS_CLK_DISABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_LCDEN) == 0U)
#endif /* LCD */

#define __HAL_RCC_RTCAPB_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_RTCAPBEN) == 0U)

#define __HAL_RCC_WWDG_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_WWDGEN) == 0U)

#if defined (LPUART3)
#define __HAL_RCC_LPUART3_IS_CLK_DISABLED()        (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART3EN) == 0U)
#endif /* LPUART3 */

#if defined (USB_DRD_FS)
#define __HAL_RCC_USB_IS_CLK_DISABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_USBEN) == 0U)
#endif /* USB_DRD_FS */

#define __HAL_RCC_SPI2_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_SPI2EN) == 0U)

#define __HAL_RCC_SPI3_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_SPI3EN) == 0U)

#define __HAL_RCC_CRS_IS_CLK_DISABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_CRSEN) == 0U)

#define __HAL_RCC_USART2_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_USART2EN) == 0U)

#define __HAL_RCC_USART3_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_USART3EN) == 0U)

#define __HAL_RCC_USART4_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_USART4EN) == 0U)

#define __HAL_RCC_LPUART1_IS_CLK_DISABLED()        (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPUART1EN) == 0U)

#define __HAL_RCC_I2C1_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C1EN) == 0U)

#define __HAL_RCC_I2C2_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C2EN) == 0U)

#define __HAL_RCC_I2C3_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C3EN) == 0U)

#define __HAL_RCC_OPAMP_IS_CLK_DISABLED()          (READ_BIT(RCC->APBENR1, RCC_APBENR1_OPAMPEN) == 0U)

#define __HAL_RCC_I2C4_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_I2C4EN) == 0U)

#if defined (LPTIM3)
#define __HAL_RCC_LPTIM3_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM3EN) == 0U)
#endif /* LPTIM3 */

#define __HAL_RCC_PWR_IS_CLK_DISABLED()            (READ_BIT(RCC->APBENR1, RCC_APBENR1_PWREN) == 0U)

#define __HAL_RCC_DAC1_IS_CLK_DISABLED()           (READ_BIT(RCC->APBENR1, RCC_APBENR1_DAC1EN) == 0U)

#define __HAL_RCC_LPTIM2_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM2EN) == 0U)

#define __HAL_RCC_LPTIM1_IS_CLK_DISABLED()         (READ_BIT(RCC->APBENR1, RCC_APBENR1_LPTIM1EN) == 0U)
/**
  * @}
  */

/** @defgroup RCC_APB_2_Peripheral_Clock_Enable_Disable_Status APB_2 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB_2 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_SYSCFG_IS_CLK_ENABLED()      (READ_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN) != 0U)

#define __HAL_RCC_COMP_IS_CLK_DISABLED()       __HAL_RCC_SYSCFG_IS_CLK_DISABLED()

#define __HAL_RCC_VREFBUF_IS_CLK_DISABLED()    __HAL_RCC_SYSCFG_IS_CLK_DISABLED()

#define __HAL_RCC_TIM1_IS_CLK_ENABLED()        (READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN)   != 0U)

#define __HAL_RCC_SPI1_IS_CLK_ENABLED()        (READ_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN)   != 0U)

#define __HAL_RCC_USART1_IS_CLK_ENABLED()      (READ_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN) != 0U)

#define __HAL_RCC_TIM15_IS_CLK_ENABLED()       (READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN)   != 0U)

#define __HAL_RCC_TIM16_IS_CLK_ENABLED()       (READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN)  != 0U)

#define __HAL_RCC_ADC_IS_CLK_ENABLED()         (READ_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN)    != 0U)

#define __HAL_RCC_COMP_IS_CLK_ENABLED()        __HAL_RCC_SYSCFG_IS_CLK_ENABLED()

#define __HAL_RCC_VREFBUF_IS_CLK_ENABLED()     __HAL_RCC_SYSCFG_IS_CLK_ENABLED()

#define __HAL_RCC_SYSCFG_IS_CLK_DISABLED()     (READ_BIT(RCC->APBENR2, RCC_APBENR2_SYSCFGEN) == 0U)

#define __HAL_RCC_TIM1_IS_CLK_DISABLED()       (READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM1EN)   == 0U)

#define __HAL_RCC_SPI1_IS_CLK_DISABLED()       (READ_BIT(RCC->APBENR2, RCC_APBENR2_SPI1EN)   == 0U)

#define __HAL_RCC_USART1_IS_CLK_DISABLED()     (READ_BIT(RCC->APBENR2, RCC_APBENR2_USART1EN) == 0U)

#define __HAL_RCC_TIM15_IS_CLK_DISABLED()      (READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM15EN)   == 0U)

#define __HAL_RCC_TIM16_IS_CLK_DISABLED()      (READ_BIT(RCC->APBENR2, RCC_APBENR2_TIM16EN)  == 0U)

#define __HAL_RCC_ADC_IS_CLK_DISABLED()        (READ_BIT(RCC->APBENR2, RCC_APBENR2_ADCEN)    == 0U)

/**
  * @}
  */

/** @defgroup RCC_AHB_Force_Release_Reset AHB Peripheral Force Release Reset
  * @brief  Force or release AHB peripheral reset.
  * @{
  */

#define __HAL_RCC_AHB_FORCE_RESET()     do { \
                                                 WRITE_REG(RCC->AHBRSTR, 0xFFFFFFFFU); \
                                               } while(0)

#define __HAL_RCC_DMA1_FORCE_RESET()          SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_DMA1RST)

#if defined (DMA2)
#define __HAL_RCC_DMA2_FORCE_RESET()          SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_DMA2RST)
#endif /* DMA2 */

#define __HAL_RCC_FLASH_FORCE_RESET()         SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_FLASHRST)

#define __HAL_RCC_CRC_FORCE_RESET()           SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_CRCRST)

#if defined (AES)
#define __HAL_RCC_AES_FORCE_RESET()           SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_AESRST)
#endif /* AES */

#define __HAL_RCC_RNG_FORCE_RESET()           SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_RNGRST)

