stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
#define __HAL_RCC_TSC_FORCE_RESET()           SET_BIT(RCC->AHBRSTR, RCC_AHBRSTR_TSCRST)

#define __HAL_RCC_AHB_RELEASE_RESET()     do { \
                                                 WRITE_REG(RCC->AHBRSTR, 0x00000000U); \
                                               } while(0)

#define __HAL_RCC_DMA1_RELEASE_RESET()          CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_DMA1RST)

#if defined (DMA2)
#define __HAL_RCC_DMA2_RELEASE_RESET()          CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_DMA2RST)
#endif /* DMA2 */

#define __HAL_RCC_FLASH_RELEASE_RESET()         CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_FLASHRST)

#define __HAL_RCC_CRC_RELEASE_RESET()           CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_CRCRST)

#define __HAL_RCC_TSC_RELEASE_RESET()           CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_TSCRST)

#define __HAL_RCC_RNG_RELEASE_RESET()           CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_RNGRST)

#if defined (AES)
#define __HAL_RCC_AES_RELEASE_RESET()           CLEAR_BIT(RCC->AHBRSTR, RCC_AHBRSTR_AESRST)
#endif /* AES */

/**
  * @}
  */

/** @defgroup RCC_IOPRSTR_Force_Release_Reset IO Peripheral Force Release Reset
  * @brief  Force or release IO peripheral reset.
  * @{
  */

#define __HAL_RCC_IOP_FORCE_RESET()     do { \
                                                 WRITE_REG(RCC->IOPRSTR, 0xFFFFFFFFU); \
                                               } while(0)

#define __HAL_RCC_GPIOA_FORCE_RESET()         SET_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOARST)

#define __HAL_RCC_GPIOB_FORCE_RESET()         SET_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOBRST)

#define __HAL_RCC_GPIOC_FORCE_RESET()         SET_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOCRST)

#define __HAL_RCC_GPIOD_FORCE_RESET()         SET_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIODRST)

#if defined(GPIOE)
#define __HAL_RCC_GPIOE_FORCE_RESET()         SET_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOERST)
#endif /* GPIOE */

#define __HAL_RCC_GPIOF_FORCE_RESET()         SET_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOFRST)

#define __HAL_RCC_IOP_RELEASE_RESET()     do { \
                                                 WRITE_REG(RCC->IOPRSTR, 0x00000000U); \
                                               } while(0)

#define __HAL_RCC_GPIOA_RELEASE_RESET()       CLEAR_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOARST)

#define __HAL_RCC_GPIOB_RELEASE_RESET()       CLEAR_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOBRST)

#define __HAL_RCC_GPIOC_RELEASE_RESET()       CLEAR_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOCRST)

#define __HAL_RCC_GPIOD_RELEASE_RESET()       CLEAR_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIODRST)

#if defined(GPIOE)
#define __HAL_RCC_GPIOE_RELEASE_RESET()       CLEAR_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOERST)
#endif /* GPIOE */

#define __HAL_RCC_GPIOF_RELEASE_RESET()       CLEAR_BIT(RCC->IOPRSTR, RCC_IOPRSTR_GPIOFRST)

/**
  * @}
  */

/** @defgroup RCC_APB_GRP1_Force_Release_Reset APB1_GRP1 Peripheral Force Release Reset
  * @brief  Force or release APB peripheral reset.
  * @{
  */

#define __HAL_RCC_APB1_GRP1_FORCE_RESET()     do { \
                                                   WRITE_REG(RCC->APBRSTR1, 0xFFFFFFFFU); \
                                                 } while(0)

#define __HAL_RCC_TIM2_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM2RST)

#define __HAL_RCC_TIM3_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM3RST)

#define __HAL_RCC_TIM6_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM6RST)

#define __HAL_RCC_TIM7_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM7RST)

#define __HAL_RCC_LPUART2_FORCE_RESET()       SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPUART2RST)

#if defined (LCD)
#define __HAL_RCC_LCD_FORCE_RESET()           SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LCDRST)
#endif /* LCD */

#if defined (LPUART3)
#define __HAL_RCC_LPUART3_FORCE_RESET()       SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPUART3RST)
#endif /* LPUART3 */

#if defined (USB_DRD_FS)
#define __HAL_RCC_USB_FORCE_RESET()           SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_USBRST)
#endif /* USB_DRD_FS */

#define __HAL_RCC_SPI2_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_SPI2RST)

#define __HAL_RCC_SPI3_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_SPI3RST)
#if defined(CRS)
#define __HAL_RCC_CRS_FORCE_RESET()           SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_CRSRST)
#endif /* CRS */
#define __HAL_RCC_USART2_FORCE_RESET()        SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_USART2RST)

#define __HAL_RCC_USART3_FORCE_RESET()        SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_USART3RST)

#define __HAL_RCC_USART4_FORCE_RESET()        SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_USART4RST)

#define __HAL_RCC_LPUART1_FORCE_RESET()       SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPUART1RST)

#define __HAL_RCC_I2C1_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_I2C1RST)

#define __HAL_RCC_I2C2_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_I2C2RST)

#define __HAL_RCC_I2C3_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_I2C3RST)

#define __HAL_RCC_OPAMP_FORCE_RESET()         SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_OPAMPRST)
#if defined(I2C4)
#define __HAL_RCC_I2C4_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_I2C4RST)
#endif /* I2C4 */
#define __HAL_RCC_PWR_FORCE_RESET()           SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_PWRRST)

#define __HAL_RCC_DAC1_FORCE_RESET()          SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_DAC1RST)

#define __HAL_RCC_LPTIM2_FORCE_RESET()        SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPTIM2RST)

#define __HAL_RCC_LPTIM1_FORCE_RESET()        SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPTIM1RST)
#if defined (LPTIM3)
#define __HAL_RCC_LPTIM3_FORCE_RESET()        SET_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPTIM3RST)
#endif /* LPTIM3 */
#define __HAL_RCC_APB1_GRP1_RELEASE_RESET()     do { \
                                                     WRITE_REG(RCC->APBRSTR1, 0x00000000U); \
                                                   } while(0)

#define __HAL_RCC_TIM2_RELEASE_RESET()          CLEAR_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM2RST)

#define __HAL_RCC_TIM3_RELEASE_RESET()          CLEAR_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM3RST)

#define __HAL_RCC_TIM6_RELEASE_RESET()          CLEAR_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM6RST)

#define __HAL_RCC_TIM7_RELEASE_RESET()          CLEAR_BIT(RCC->APBRSTR1, RCC_APBRSTR1_TIM7RST)

#define __HAL_RCC_LPUART2_RELEASE_RESET()       CLEAR_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LPUART2RST)

#if defined (LCD)
#define __HAL_RCC_LCD_RELEASE_RESET()           CLEAR_BIT(RCC->APBRSTR1, RCC_APBRSTR1_LCDRST)
#endif /* LCD */

