stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
#if defined (GPIOE)
#define __HAL_RCC_GPIOE_CLK_SLEEP_ENABLE()          SET_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOESMEN)
#endif /* GPIOE */

#define __HAL_RCC_GPIOF_CLK_SLEEP_ENABLE()          SET_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOFSMEN)

#define __HAL_RCC_GPIOA_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOASMEN)

#define __HAL_RCC_GPIOB_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOBSMEN)

#define __HAL_RCC_GPIOC_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOCSMEN)

#define __HAL_RCC_GPIOD_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIODSMEN)

#if defined (GPIOE)
#define __HAL_RCC_GPIOE_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOESMEN)
#endif /* GPIOE */

#define __HAL_RCC_GPIOF_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->IOPSMENR, RCC_IOPSMENR_GPIOFSMEN)

/**
  * @}
  */

/** @defgroup RCC_APB_Clock_Sleep_Enable_Disable APB Peripheral Clock Sleep Enable Disable
  * @brief  Enable or disable the APB peripheral clock during Low Power (Sleep) mode.
  * @note   Peripheral clock gating in SLEEP mode can be used to further reduce
  *         power consumption.
  * @note   After wakeup from SLEEP mode, the peripheral clock is enabled again.
  * @note   By default, all peripheral clocks are enabled during SLEEP mode.
  * @{
  */

#define __HAL_RCC_TIM2_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM2SMEN)

#define __HAL_RCC_TIM3_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM3SMEN)

#define __HAL_RCC_TIM6_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM6SMEN)

#define __HAL_RCC_TIM7_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM7SMEN)

#define __HAL_RCC_LPUART2_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPUART2SMEN)

#if defined (LCD)
#define __HAL_RCC_LCD_CLK_SLEEP_ENABLE()            SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LCDSMEN)
#endif /* LCD */

#define __HAL_RCC_RTCAPB_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_RTCAPBSMEN)

#define __HAL_RCC_WWDG_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_WWDGSMEN)

#if defined (LPUART3)
#define __HAL_RCC_LPUART3_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPUART3SMEN)
#endif /* LPUART3 */

#if defined (USB_DRD_FS)
#define __HAL_RCC_USB_CLK_SLEEP_ENABLE()            SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USBSMEN)
#endif /* USB_DRD_FS */

#define __HAL_RCC_SPI2_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_SPI2SMEN)

#define __HAL_RCC_SPI3_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_SPI3SMEN)
#if defined(CRS)
#define __HAL_RCC_CRS_CLK_SLEEP_ENABLE()            SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_CRSSMEN)
#endif /* CRS */
#define __HAL_RCC_USART2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USART2SMEN)

#define __HAL_RCC_USART3_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USART3SMEN)

#define __HAL_RCC_USART4_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USART4SMEN)

#define __HAL_RCC_LPUART1_CLK_SLEEP_ENABLE()        SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPUART1SMEN)

#define __HAL_RCC_I2C1_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_I2C1SMEN)

#define __HAL_RCC_I2C2_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_I2C2SMEN)

#define __HAL_RCC_I2C3_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_I2C3SMEN)

#define __HAL_RCC_OPAMP_CLK_SLEEP_ENABLE()          SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_OPAMPSMEN)
#if defined(I2C4)
#define __HAL_RCC_I2C4_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_I2C4SMEN)
#endif /* I2C4 */
#if defined (LPTIM3)
#define __HAL_RCC_LPTIM3_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPTIM3SMEN)
#endif /* LPTIM3 */

#define __HAL_RCC_PWR_CLK_SLEEP_ENABLE()            SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_PWRSMEN)

#define __HAL_RCC_DAC1_CLK_SLEEP_ENABLE()           SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_DAC1SMEN)

#define __HAL_RCC_LPTIM2_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPTIM2SMEN)

#define __HAL_RCC_LPTIM1_CLK_SLEEP_ENABLE()         SET_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPTIM1SMEN)

#define __HAL_RCC_TIM2_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM2SMEN)

#define __HAL_RCC_TIM3_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM3SMEN)

#define __HAL_RCC_TIM6_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM6SMEN)

#define __HAL_RCC_TIM7_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_TIM7SMEN)

#define __HAL_RCC_LPUART2_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPUART2SMEN)

#if defined (LCD)
#define __HAL_RCC_LCD_CLK_SLEEP_DISABLE()            CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LCDSMEN)
#endif /* LCD */

#define __HAL_RCC_RTCAPB_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_RTCAPBSMEN)

#define __HAL_RCC_WWDG_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_WWDGSMEN)

#if defined (LPUART3)
#define __HAL_RCC_LPUART3_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPUART3SMEN)
#endif /* LPUART3 */

#if defined (USB_DRD_FS)
#define __HAL_RCC_USB_CLK_SLEEP_DISABLE()            CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USBSMEN)
#endif /* USB_DRD_FS */

#define __HAL_RCC_SPI2_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_SPI2SMEN)

#define __HAL_RCC_SPI3_CLK_SLEEP_DISABLE()           CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_SPI3SMEN)

#if defined(CRS)
#define __HAL_RCC_CRS_CLK_SLEEP_DISABLE()            CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_CRSSMEN)
#endif /* CRS */

#define __HAL_RCC_USART2_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USART2SMEN)

#define __HAL_RCC_USART3_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USART3SMEN)

#define __HAL_RCC_USART4_CLK_SLEEP_DISABLE()         CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_USART4SMEN)

#define __HAL_RCC_LPUART1_CLK_SLEEP_DISABLE()        CLEAR_BIT(RCC->APBSMENR1, RCC_APBSMENR1_LPUART1SMEN)

