stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_hal_rcc.h
#define IS_RCC_PCLK(__PCLK__) (((__PCLK__) == RCC_HCLK_DIV1) || ((__PCLK__) == RCC_HCLK_DIV2) || \
                               ((__PCLK__) == RCC_HCLK_DIV4) || ((__PCLK__) == RCC_HCLK_DIV8) || \
                               ((__PCLK__) == RCC_HCLK_DIV16))

#define IS_RCC_RTCCLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_RTCCLKSOURCE_NONE)   || \
                                         ((__SOURCE__) == RCC_RTCCLKSOURCE_LSE)    || \
                                         ((__SOURCE__) == RCC_RTCCLKSOURCE_LSI)    || \
                                         ((__SOURCE__) == RCC_RTCCLKSOURCE_HSE))

#define IS_RCC_MCO(__MCOX__) ( ((__MCOX__) == RCC_MCO1_PA8)  || \
                               ((__MCOX__) == RCC_MCO1_PA9)  || \
                               ((__MCOX__) == RCC_MCO1_PF2)  || \
                               ((__MCOX__) == RCC_MCO2_PA10) || \
                               ((__MCOX__) == RCC_MCO2_PC2)  || \
                               ((__MCOX__) == RCC_MCO2_PA8))
#if defined(RCC_MCO1SOURCE_HSI48)
#define IS_RCC_MCO1SOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCO1SOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_MSI) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_HSE) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_PLLR) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_LSE) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_HSI48) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_RTC_ALT) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_RTC_WAKEUP))
#else
#define IS_RCC_MCO1SOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCO1SOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_MSI) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_HSE) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_PLLR) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_LSE) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_RTC_ALT) || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_RTC_WAKEUP))
#endif /* RCC_MCO1SOURCE_HSI48 */
#if defined(RCC_MCO2SOURCE_HSI48)
#define IS_RCC_MCO2SOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCO2SOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_MSI) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_HSE) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_PLLR) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_LSE) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_HSI48) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_RTC_ALT) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_RTC_WAKEUP))
#else
#define IS_RCC_MCO2SOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCO2SOURCE_NOCLOCK) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_SYSCLK) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_MSI) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_HSI) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_HSE) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_PLLR) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_LSI) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_LSE) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_RTC_ALT) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_RTC_WAKEUP))
#endif /* RCC_MCO2SOURCE_HSI48 */
#define IS_RCC_MCO1DIV(__DIV__) (((__DIV__) == RCC_MCO1DIV_1) || ((__DIV__) == RCC_MCO1DIV_2)  || \
                                 ((__DIV__) == RCC_MCO1DIV_4) || ((__DIV__) == RCC_MCO1DIV_8)  || \
                                 ((__DIV__) == RCC_MCO1DIV_16)|| ((__DIV__) == RCC_MCO1DIV_32) || \
                                 ((__DIV__) == RCC_MCO1DIV_64)|| ((__DIV__) == RCC_MCO1DIV_128)|| \
                                 ((__DIV__) == RCC_MCO1DIV_256)|| ((__DIV__) == RCC_MCO1DIV_512)|| \
                                 ((__DIV__) == RCC_MCO1DIV_1024))

#define IS_RCC_MCO2DIV(__DIV__) (((__DIV__) == RCC_MCO2DIV_1) || ((__DIV__) == RCC_MCO2DIV_2) || \
                                 ((__DIV__) == RCC_MCO2DIV_4) || ((__DIV__) == RCC_MCO2DIV_8) || \
                                 ((__DIV__) == RCC_MCO2DIV_16)|| ((__DIV__) == RCC_MCO2DIV_32) || \
                                 ((__DIV__) == RCC_MCO2DIV_64)|| ((__DIV__) == RCC_MCO2DIV_128)|| \
                                 ((__DIV__) == RCC_MCO2DIV_256)|| ((__DIV__) == RCC_MCO2DIV_512)|| \
                                 ((__DIV__) == RCC_MCO2DIV_1024))

#define IS_RCC_LSE_DRIVE(__DRIVE__) (((__DRIVE__) == RCC_LSEDRIVE_LOW)        || \
                                     ((__DRIVE__) == RCC_LSEDRIVE_MEDIUMLOW)  || \
                                     ((__DRIVE__) == RCC_LSEDRIVE_MEDIUMHIGH) || \
                                     ((__DRIVE__) == RCC_LSEDRIVE_HIGH))

